app/controllers/moos_controller.rb

SELECT "moos".* FROM "moos"
---
    def index

        @moo = Moo.all

INSERT INTO "moos" ("classes", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["classes", ""], ["description", ""], ["created_at", "2017-10-26 16:07:32.053363"], ["updated_at", "2017-10-26 16:07:32.053363"]]
---
    def create

        @moo = Moo.create(moo_params)

SELECT  "moos".* FROM "moos" WHERE "moos"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def show

        @moo = Moo.find(params[:id])

SELECT  "moos".* FROM "moos" WHERE "moos"."id" = ? LIMIT ?  [["id", 12], ["LIMIT", 1]]
---
    def edit

        @moo = Moo.find(params[:id])

SELECT  "moos".* FROM "moos" WHERE "moos"."id" = ? LIMIT ?  [["id", 12], ["LIMIT", 1]]
---
    def update

        @moo = Moo.find(params[:id])

SELECT  "moos".* FROM "moos" WHERE "moos"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
DELETE FROM "moos" WHERE "moos"."id" = ?  [["id", 6]]
---
    def destroy

        @moo = Moo.find(params[:id])

        @moo.destroy